/*___________________________________________________________________________
Автор: Иевлев А.А. студент АПО-13

Задача 2_3:
Даны два строго возрастающих массива целых чисел A[0..n) и B[0..m) и число k. 
Найти количество таких пар индексов (i, j), что A[i] + B[j] = k. 
Время работы O(n + m).

n, m ≤ 100000.
Указание: Обходите массив B от конца к началу.
_____________________________________________________________________________
Формат входных данных
in
4
-5 0 3 18
5
-10 -2 4 7 12
7
out 
3
___________________________________________________________________________*/


#include <stdio.h>

int count_pairs(int *a, int *b, int sum){
   int i=0, j=m-1, k=0;
   while(i<n && j>=0){
      if(sum-b[j]==a[i]) k++;
      if(sum-b[j]>=a[i]) i++; else
      j--;
   } 
   return k;
}

int main(){
   int a[100000], b[100000], n, m;

   scanf("%i", &n);
   for(int i=0; i<n; i++)
      scanf("%i", &a[i]);

   scanf("%i", &m);
   for(int i=0; i<m; i++)
      scanf("%i", &b[i]);

   scanf("%i", &sum);

   printf("%i", count_pairs(a, b, sum));

   return 0;
}
